[
  {
    "id": 1001,
    "title": "The Time Has Come",
    "author": "Jane Smith",
    "price": 27.89,
    "originalPrice": 30.99,
    "description": "Lindbergh's Pharmacy is an Athens, Georgia, institution where community bonds have formed over generations. In this stirring narrative, the lives of its patrons and employees intersect in powerful, life-altering ways. As secrets unravel and hidden truths come to light, characters find redemption in unexpected places. The story takes a deep dive into resilience, forgiveness, and the beauty of second chances. With lyrical prose and emotionally rich storytelling, Jane Smith delivers a compelling novel of hope and healing.",
    "genre": "Fiction",
    "coverImage": "the_time_has_come.jpeg",
    "quantity": 1,
    "authorBio": "Jane Smith is a bestselling novelist known for her richly drawn characters and emotionally resonant storytelling. Her work often explores themes of community, resilience, and personal transformation.",
    "rating": 4.2,
    "coverImageUrl": "http://localhost:3000/images/the_time_has_come.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1002,
    "title": "I Want a Better Catastrophe",
    "author": "John Doe",
    "price": 26.99,
    "originalPrice": 29.99,
    "description": "With global warming projected to rocket past the tipping point, the book challenges us to reimagine our response to climate disaster. John Doe presents eye-opening interviews and personal reflections, blending science with deep humanity. Through vivid storytelling, he explores how individuals and societies can find purpose amid collapse. The narrative is both sobering and inspiring, offering strategies for resilience and adaptation. It invites readers to face the climate crisis with honesty and courage, while still envisioning a meaningful future.",
    "genre": "Non-Fiction",
    "coverImage": "i_want_a_better_catastrophe_.jpeg",
    "quantity": 1,
    "authorBio": "John Doe is an environmental writer and activist with over 20 years of experience in climate advocacy. He is recognized for his ability to make complex environmental issues deeply personal and accessible.",
    "rating": 4.1,
    "coverImageUrl": "http://localhost:3000/images/i_want_a_better_catastrophe_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1003,
    "title": "My Government Means to Kill Me",
    "author": "Sarah Johnson",
    "price": 24.5,
    "originalPrice": 27.99,
    "description": "This powerful coming-of-age story follows a young Black gay man navigating identity, politics, and survival in 1980s America. The protagonist's journey is set against the backdrop of the AIDS crisis and social injustice. Sarah Johnson crafts a haunting and vivid portrait of strength amid marginalization. The narrative highlights the importance of community, activism, and self-discovery. It's a bold and unapologetic exploration of life, love, and the costs of being different in a society that demands conformity.",
    "genre": "Biography",
    "coverImage": "my_government_means_to_kill_me_.jpeg",
    "quantity": 1,
    "authorBio": "Sarah Johnson is a renowned biographer and LGBTQ+ rights advocate. Her work centers on historically marginalized voices, aiming to bring their stories to the forefront of cultural conversation.",
    "rating": 4.3,
    "coverImageUrl": "http://localhost:3000/images/my_government_means_to_kill_me_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1004,
    "title": "The Last Thing He Told Me",
    "author": "Laura Dave",
    "price": 22.99,
    "originalPrice": 25.99,
    "description": "When Hannah's husband disappears, leaving behind only a cryptic note, she is forced to unravel a mystery that upends everything she thought she knew. As she dives deeper into his past, shocking revelations come to light. The story is a gripping tale of love, betrayal, and the lengths we go to protect the ones we love. Laura Dave masterfully crafts a suspenseful journey full of emotional depth and intrigue. With each page, readers are drawn closer to a truth that changes everything.",
    "genre": "Mystery",
    "coverImage": "the_last_thing_he_told_me_.jpeg",
    "quantity": 1,
    "authorBio": "Laura Dave is a celebrated mystery and thriller writer, known for her character-driven plots and emotionally complex storytelling. Her novels have been adapted into major film and television productions.",
    "rating": 4.4,
    "coverImageUrl": "http://localhost:3000/images/the_last_thing_he_told_me_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1005,
    "title": "Pride and Protest",
    "author": "Nikki Payne",
    "price": 15.5,
    "originalPrice": 18.5,
    "description": "This modern retelling of a classic love story brings fresh perspective to themes of identity and resistance. In the heart of a gentrifying neighborhood, a passionate woman confronts the wealthy CEO responsible for community upheaval. Sparks fly, and what begins as conflict evolves into unexpected romance. Nikki Payne's voice is witty, bold, and deeply rooted in cultural commentary. It's a compelling story about standing your ground and opening your heart to change.",
    "genre": "Fiction",
    "coverImage": "pride_and_protest_.jpeg",
    "quantity": 1,
    "authorBio": "Nikki Payne is a contemporary fiction writer whose work explores race, class, and love through engaging, character-driven narratives. She is a champion of diverse voices in modern storytelling.",
    "rating": 4,
    "coverImageUrl": "http://localhost:3000/images/pride_and_protest_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1006,
    "title": "Forget a Mentor, Find a Sponsor",
    "author": "Sylvia Ann Hewlett",
    "price": 29.99,
    "originalPrice": 32.99,
    "description": "In today's competitive professional landscape, having a mentor isn't enough—what you need is a sponsor. Sylvia Ann Hewlett reveals the power of sponsorship: a game-changing relationship that can fast-track your career. Through research and real-world case studies, she explains how to attract the attention of key influencers and leverage their advocacy. The book provides actionable strategies for women and minorities to break the glass ceiling. It's a call to move beyond advice and build real alliances that open doors.",
    "genre": "Non-Fiction",
    "coverImage": "forget_a_mentor__find_a_sponsor.jpeg",
    "quantity": 1,
    "authorBio": "Sylvia Ann Hewlett is an economist and thought leader in workplace innovation and inclusion. She is the founder of the Center for Talent Innovation and a prominent advocate for women's leadership.",
    "rating": 4.2,
    "coverImageUrl": "http://localhost:3000/images/forget_a_mentor__find_a_sponsor.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1007,
    "title": "The Midnight Library",
    "author": "Matt Haig",
    "price": 21.99,
    "originalPrice": 24.99,
    "description": "Between life and death lies a library with endless shelves, each book offering a different version of your life. Nora Seed finds herself in this magical space after a desperate moment, given the chance to see what might have been. As she explores alternate lives, she learns what really makes life meaningful. Matt Haig blends philosophy, fantasy, and emotional wisdom into a heartwarming journey. It's a celebration of choice, second chances, and the beauty of being alive.",
    "genre": "Fiction",
    "coverImage": "the_midnight_library.jpeg",
    "quantity": 1,
    "authorBio": "Matt Haig is a British author and mental health advocate whose bestselling works often explore themes of depression, hope, and self-discovery. His books have touched readers worldwide with their empathy and insight.",
    "rating": 4.6,
    "coverImageUrl": "http://localhost:3000/images/the_midnight_library.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1008,
    "title": "Project Hail Mary",
    "author": "Andy Weir",
    "price": 28.99,
    "originalPrice": 32.99,
    "description": "Ryland Grace wakes up alone in a spaceship, with no memory of his mission or identity. Slowly, he uncovers that he's humanity's last hope to stop an extinction-level threat. Andy Weir takes readers on a gripping space adventure filled with science, suspense, and surprising friendship. The story balances thrilling problem-solving with deep human emotion. It's an epic tale of survival, sacrifice, and redemption that keeps readers hooked until the final page.",
    "genre": "Sci-Fi",
    "coverImage": "project_hail_mary.jpeg",
    "quantity": 1,
    "authorBio": "Andy Weir is a former software engineer turned author best known for his debut novel 'The Martian.' He specializes in scientifically grounded science fiction with thrilling narratives and unexpected humor.",
    "rating": 4.7,
    "coverImageUrl": "http://localhost:3000/images/project_hail_mary.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1009,
    "title": "The Invisible Life of Addie LaRue",
    "author": "V.E. Schwab",
    "price": 25.99,
    "originalPrice": 28.99,
    "description": "Addie LaRue makes a Faustian bargain to live forever—but in exchange, she is forgotten by everyone she meets. Across centuries, she navigates loneliness, love, and rebellion against her fate. V.E. Schwab spins a haunting and poetic tale of immortality, identity, and the deep desire to leave a mark. With lyrical prose and vivid imagery, this book stays with readers long after it ends. It's a masterclass in fantasy that's both intimate and epic in scale.",
    "genre": "Fiction",
    "coverImage": "the_invisible_life_of_addie_larue_.jpeg",
    "quantity": 1,
    "authorBio": "V.E. Schwab is a bestselling fantasy author known for her imaginative worlds and complex characters. Her stories often explore themes of power, legacy, and the struggle for self-definition.",
    "rating": 4.5,
    "coverImageUrl": "http://localhost:3000/images/the_invisible_life_of_addie_larue_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1010,
    "title": "Klara and the Sun",
    "author": "Kazuo Ishiguro",
    "price": 26.95,
    "originalPrice": 29.95,
    "description": "Klara is an Artificial Friend with keen observational skills and boundless curiosity about human emotions. She watches the world from a store window, longing to be chosen by a child. When she finally joins a family, she embarks on a quest to understand love, loyalty, and sacrifice. Ishiguro blends futuristic themes with emotional subtlety in this meditation on what makes us human. It's a novel of quiet power and haunting beauty that challenges how we define connection.",
    "genre": "Sci-Fi",
    "coverImage": "klara_and_the_sun.jpeg",
    "quantity": 1,
    "authorBio": "Kazuo Ishiguro is a Nobel Prize-winning author whose works explore memory, identity, and morality. He is acclaimed for his literary style that combines elegance with emotional complexity.",
    "rating": 4.3,
    "coverImageUrl": "http://localhost:3000/images/klara_and_the_sun.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1011,
    "title": "Sunrise on the Reaping",
    "author": "Suzanne Collins",
    "price": 1000,
    "originalPrice": 1500,
    "description": "Set 24 years before The Hunger Games, this prequel follows 16-year-old Haymitch Abernathy during the Second Quarter Quell. As he battles in the arena and faces the Capitol's manipulations, he learns the brutal cost of survival. The story reveals the political tensions and emotional scars that shape him into the mentor Katniss will one day know. Suzanne Collins delivers another raw and riveting tale of resistance and rebellion. It's a powerful addition to the dystopian saga that redefines heroism.",
    "genre": "Sci-Fi",
    "coverImage": "content__1_.jpeg",
    "quantity": 1,
    "authorBio": "Suzanne Collins is the author of the global phenomenon 'The Hunger Games' series. Her dystopian novels are lauded for their critique of power, violence, and societal inequality.",
    "rating": 4.8,
    "coverImageUrl": "http://localhost:3000/images/content__1_.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1012,
    "title": "Onyx Storm",
    "author": "Rebecca Yarros",
    "price": 399,
    "originalPrice": 500,
    "description": "Violet Sorrengail returns to the dragon-rider war college to confront an impossible rescue and a brewing civil war. With danger rising and alliances shifting, she must test her courage, strength, and loyalty. Rebecca Yarros crafts a world of elemental magic, fierce romance, and epic battles. The stakes are higher than ever as Violet learns that being chosen by a dragon doesn't guarantee survival. It's a breathtaking fantasy that's as fierce as it is emotionally charged.",
    "genre": "Biography",
    "coverImage": "content.jpeg",
    "quantity": 1,
    "authorBio": "Rebecca Yarros is a bestselling author of romantic fantasy and military fiction. Her emotionally rich stories often feature strong heroines, sweeping world-building, and intense relationships.",
    "rating": 4.6,
    "coverImageUrl": "http://localhost:3000/images/content.jpeg",
    "imageSource": "view"
  },
  {
    "id": 1013,
    "title": "It's Not Just My Only Love Story",
    "author": "Bhubanesh Baisakha",
    "price": 27.89,
    "originalPrice": 30.99,
    "description": "It is a story that takes you into the life of a 12 years old young boy called Brijesh who always had certain awkwardness around girls to which he finally overcame when on one fine winter morning he met a girl around his age in the school bus. Soon, their friendship grew which later got converted into a flawed love story. Though they survived the early challenges of romantic relationships that one faces at that young age, but their hearts were still filled with doubts.",
    "genre": "Romance",
    "coverImage": "1749818835291-250254299-content2.jpeg",
    "coverImageUrl": "http://localhost:3000/images/1749818835291-250254299-content2.jpeg",
    "quantity": 1,
    "authorBio": "Bhubanesh Baisakha is currently working as an independently practiced professional counselor who comes from a middle class family, living in Cuttack, a small city of the state Odisha, who in spite belonging to the world of mental health has suffered personally from acute depression and anxiety which he overcame by learning to let go of things. He did his schooling from DAV Public School. He did his graduation in Psychology Honors from reputed Ravenshaw University. He completed his masters from prestigious Banaras Hindu University.",
    "rating": 3.4,
    "imageSource": "update",
    "existingCoverImage": ""
  },
  {
    "id": 1014,
    "title": " I Too Had a Love Story",
    "author": "Ravinder Singh ",
    "price": 299,
    "genre": "Romance",
    "rating": 4.9,
    "description": "It is believed that love is the most magical feeling in the world. Yet, only a few lucky ones get to experience it in their lives. If the beginning of Ravin and Khushi's journey is anything to go by, their story is bound to be anything but conventional. However, if they have been lucky enough to find true love in each other, will they have the strength to deal with the biggest challenge life throws their way? It has been three years since Ravin graduated from engineering college and, slowly but surely, he is beginning to get his ducks in a row. He has a decent job, a stable salary, and has his eyes set on an MBA. Is this a good time to start thinking about 'settling down'? How does one even find love? Read on to see how Ravin goes about finding the answers to his questions in the first part of Ravinder Singh's powerful love story, I Too Had a Love Story.",
    "originalPrice": 200,
    "authorBio": "Ravinder Singh is an Indian software engineer and author of nine novels — I Too Had a Love Story, Can Love Happen Twice?, Like it happened Yesterday, Love Stories That Touched My Heart, Tell Me A Story, Your Dreams are Mine Now, This Love That Feels Right, Will You Still Love Me? and The Belated Bachelor Party.",
    "quantity": 200,
    "coverImage": "1749818937784-852821436-content4.jpeg",
    "imageSource": "add",
    "coverImageUrl": "http://localhost:3000/images/1749818937784-852821436-content4.jpeg"
  }
]
